package bot.commands;

public class AboutCommand implements Command { // implements → когда класс реализует интерфейс.

    @Override // метод переопределяет метод родительского класса или интерфейса
    public String getName() 
    { 
    	return "/about"; 
    }

    @Override
    public String getInformation() 
    { 
    	return "Краткое описание бота"; 
    }

    @Override
    public String realization(String[] args) 
    {
        return "👋 Привет! Я твой надежный помощник в учебе \r\n"
        		+ "\r\n"
        		+ "Я буду:\r\n"
        		+ "• 📅 Следить за расписанием пар\r\n"
        		+ "• 📚 Напоминать о домашних заданиях  \r\n"
        		+ "• ⏰ Присылать уведомления в удобное время\r\n"
        		+ "• 💫 Помогать учиться без лишнего стресса\r\n"
        		+ "\r\n"
        		+ "Вместе мы сделаем учебу проще! ✨";
    }
    
}
