package bot.commands;

public class AuthorsCommand implements Command {
	
	@Override // метод переопределяет метод родительского класса или интерфейса
    public String getName() 
    { 
    	return "/authors"; 
    }

    @Override
    public String getInformation() 
    { 
    	return "Рассказывает о разработчиках бота"; 
    }

    @Override
    public String realization(String[] args) 
    {
        return "👋 Привет! Мы - Виктория Нестерова и Александр Воробьёв\n\n"
        		+ "📖 Студенты группы МЕН-241001 (КБ-202)\r\n"
        		+ "\r\n"
        		+ "Создали этого бота, чтобы помочь таким же студентам, как мы! ❤️";
    }

}
